*** Solution

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <vector>
  #include <algorithm>
  using namespace std;

  void displayVector(const vector<string>& v) {
      for (auto line : v) {
          cout << line << "\n";
      }

      cout << "\n";
  }

  int treeCount(const vector<string>& grid) {
      int i = 0;
      int j = 0;
      int rows = grid.size();
      int cols = grid[0].length();
      int treeCount = 0;

      while (i < rows && j < cols) {
          if (grid[i][j] == '#') // tree
              ++treeCount;

          j = (j + 3) % cols;
          ++i;
      }

      return treeCount;
  }

  int main() {
      vector<string> grid;
      ifstream file("input");
      string line;

      while(file >> line) {
          grid.push_back(line);
      }

      file.close();

      // displayVector(grid);

      cout << treeCount(grid) << "\n";
  }
#+end_src

#+RESULTS:
: 220

*** Solution

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <vector>
  #include <algorithm>
  using namespace std;

  void displayVector(const vector<string>& v) {
      for (auto line : v) {
          cout << line << "\n";
      }

      cout << "\n";
  }

  int treeCount(const vector<string>& grid, int right, int down) {
      int i = 0;
      int j = 0;
      int rows = grid.size();
      int cols = grid[0].length();
      int treeCount = 0;

      while (i < rows && j < cols) {
          if (grid[i][j] == '#') // tree
              ++treeCount;

          j = (j + right) % cols;
          i += down;
      }

      return treeCount;
  }

  int main() {
      vector<string> grid;
      ifstream file("input");
      string line;

      while(file >> line) {
          grid.push_back(line);
      }

      file.close();

      // displayVector(grid);

      cout << treeCount(grid, 1, 1) * treeCount(grid, 3, 1) * treeCount(grid, 5, 1) * treeCount(grid, 7, 1) * treeCount(grid, 1, 2)
           << "\n";
  }
#+end_src

#+RESULTS:
: 2138320800

